const areas = [
  { name: "Αλικαρνασσός - Γεωργικά", originalName: "ΑΛΙΚΑΡΝΑΣΣΟΣ-ΓΕΩΡΓΙΚΑ" },
  {
    name: "Αλικαρνασσός - Θαλασσινά",
    originalName: "ΑΛΙΚΑΡΝΑΣΣΟΣ-ΘΑΛΑΣΣΙΝΑ",
  },
  { name: "Άνω Αλικαρνασσός", originalName: "ΑΝΩ ΑΛΙΚΑΡΝΑΣΣΟΣ" },
  {
    name: "Βελόνι Κάμπος - Νέος Κόσμος - Αγ.Ιωάννης Χωστός - ΤΕΙ",
    originalName: "ΒΕΛΟΝΙ ΚΑΜΠΟΣ-ΝΕΟΣ ΚΟΣΜΟΣ-ΑΓ.ΙΩΑΝΝΗΣ ΧΩΣΤΟΣ-ΤΕΙ",
  },
  { name: "Αγ.Τριάδα", originalName: "ΗΡΑΚΛΕΙΟ -ΑΓ.ΤΡΙΑΔΑ" },
  {
    name: "Ηράκλειο Eντός Τείχων - Προάστια",
    originalName: "ΗΡΑΚΛΕΙΟ EΝΤΟΣ ΤΕΙΧΩΝ-ΠΡΟΑΣΤΙΑ",
  },
  { name: "Ατσαλένιο Ι", originalName: "ΗΡΑΚΛΕΙΟ ΣΥΝΟΙΚΙΑ ΑΤΣΑΛΕΝΙΟ Ι" },
  {
    name: "Ηράκλειο - Περιοχή Λάκος - Πανάνειο",
    originalName: "ΗΡΑΚΛΕΙΟ-ΠΕΡΙΟΧΗ ΛΑΚΟΣ-ΠΑΝΑΝΕΙΟ",
  },
  { name: "Ατσαλένιο ΙΙ", originalName: "ΗΡΑΚΛΕΙΟ-ΣΥΝΟΙΚΙΑ ΑΤΣΑΛΕΝΙΟ ΙΙ" },
  { name: "Μασταμπάς", originalName: "ΗΡΑΚΛΕΙΟ-ΣΥΝΟΙΚΙΑ ΜΑΣΤΑΜΠΑΣ" },
  { name: "Κατσαμπάς ΙΙ", originalName: "ΣΥΝΟΙΚΙΑ - ΚΑΤΣΑΜΠΑΣ ΙΙ" },
  { name: "Θέρισσος Ι", originalName: "ΣΥΝΟΙΚΙΑ -ΘΕΡΙΣΣΟΣ Ι" },
  {
    name: "Αγ.Αικατερίνη - Εργατικές Κατοικίες",
    originalName: "ΣΥΝΟΙΚΙΑ ΑΓ. ΑΙΚΑΤΕΡΙΝΗΣ -ΕΡΓΑΤΙΚΕΣ ΚΑΤΟΙΚΙΕΣ",
  },
  { name: "Αγ.Αικατερίνης Ι", originalName: "ΣΥΝΟΙΚΙΑ ΑΓ. ΑΙΚΑΤΕΡΙΝΗΣ Ι" },
  { name: "Αγ.Ιωάννης", originalName: "ΣΥΝΟΙΚΙΑ ΑΓ. ΙΩΑΝΝΗΣ" },
  {
    name: "Αγ.Αικατερίνης ΙΙ - Τμήμα Πατελών - Τμήμα Φιλοθέης",
    originalName: "ΣΥΝΟΙΚΙΑ ΑΓ.ΑΙΚΑΤΕΡΙΝΗΣ ΙΙ - ΤΜΗΜΑ ΠΑΤΕΛΩΝ-ΤΜΗΜΑ ΦΙΛΟΘΕΗΣ",
  },
  { name: "Αγ.Αικατερίνης ΙΙΙ", originalName: "ΣΥΝΟΙΚΙΑ ΑΓ.ΑΙΚΑΤΕΡΙΝΗΣ ΙΙΙ" },
  { name: "Δειλινά", originalName: "ΣΥΝΟΙΚΙΑ ΔΕΙΛΙΝΑ" },
  {
    name: "Θέρισσος ΙΙ - Μιχαήλ Αρχάγγελου",
    originalName: "ΣΥΝΟΙΚΙΑ ΘΕΡΙΣΣΟΣ ΙΙ-ΠΕΡΙΟΧΗ ΜΙΧΑΗΛ ΑΡΧΑΓΓΕΛΟΥ",
  },
  { name: "Καμίνια", originalName: "ΣΥΝΟΙΚΙΑ ΚΑΜΙΝΙΑ" },
  { name: "Κηπούπολη ΙΙ", originalName: "ΣΥΝΟΙΚΙΑ ΚΗΠΟΥΠΟΛΗ ΙΙ" },
  { name: "Κηπούπολη Ι", originalName: "ΣΥΝΟΙΚΙΑ ΚΗΠΟΥΠΟΛΗ Ι" },
  { name: "Πατέλες", originalName: "ΣΥΝΟΙΚΙΑ ΠΑΤΕΛΕΣ" },
  { name: "Πόρος ΙΙ", originalName: "ΣΥΝΟΙΚΙΑ ΠΟΡΟΣ ΙΙ" },
  { name: "Πόρος Ι", originalName: "ΣΥΝΟΙΚΙΑ ΠΟΡΟΣ Ι" },
  { name: "Κατσαμπάς Ι", originalName: "ΣΥΝΟΙΚΙΑ-ΚΑΤΣΑΜΠΑΣ Ι" },
  { name: "Φοινικιά", originalName: "ΦΟΙΝΙΚΙΑ" },
];

function getAreaName(areaName) {
  const result = areas.filter((area) => area.originalName === areaName);
  if (result.length > 0) {
    return result[0].name;
  } else {
    return null;
  }
}

export { getAreaName as default };
