import { stringify } from '@angular/compiler/src/util';
import { Pipe, PipeTransform } from '@angular/core';

@Pipe({
  name: 'area',
})
export class AreaPipe implements PipeTransform {
  transform(value: string): string {
    let area: string;
    switch (value) {
      case 'ΑΛΙΚΑΡΝΑΣΣΟΣ-ΘΑΛΑΣΣΙΝΑ':
        area = 'Αλικαρνασσός - Θαλασσινά';
        break;
      case 'ΑΛΙΚΑΡΝΑΣΣΟΣ-ΓΕΩΡΓΙΚΑ':
        area = 'Αλικαρνασσός - Γεωργικά';
        break;
      case 'ΑΝΩ ΑΛΙΚΑΡΝΑΣΣΟΣ':
        area = 'Άνω Αλικαρνασσός';
        break;
      case 'ΣΥΝΟΙΚΙΑ-ΚΑΤΣΑΜΠΑΣ Ι':
        area = 'Κατσαμπάς Ι';
        break;
      case 'ΣΥΝΟΙΚΙΑ - ΚΑΤΣΑΜΠΑΣ ΙΙ':
        area = 'Κατσαμπάς ΙΙ';
        break;
      case 'ΣΥΝΟΙΚΙΑ -ΘΕΡΙΣΣΟΣ Ι':
        area = 'Θέρισσος Ι';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΠΟΡΟΣ Ι':
        area = 'Πόρος Ι';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΠΟΡΟΣ ΙΙ':
        area = 'Πόρος ΙΙ';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΠΑΤΕΛΕΣ':
        area = 'Πατέλες';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΑΓ. ΑΙΚΑΤΕΡΙΝΗΣ Ι':
        area = 'Αγ. Αικατερίνης Ι';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΑΓ.ΑΙΚΑΤΕΡΙΝΗΣ ΙΙ - ΤΜΗΜΑ ΠΑΤΕΛΩΝ-ΤΜΗΜΑ ΦΙΛΟΘΕΗΣ':
        area = 'Αγ. Αικατερίνης ΙΙ - Πατέλες/Φιλοθέη';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΚΗΠΟΥΠΟΛΗ Ι':
        area = 'Κηπούπολη Ι';
        break;
      case 'ΗΡΑΚΛΕΙΟ -ΑΓ.ΤΡΙΑΔΑ':
        area = 'Αγ. Τριάδα';
        break;
      case 'ΗΡΑΚΛΕΙΟ-ΠΕΡΙΟΧΗ ΛΑΚΟΣ-ΠΑΝΑΝΕΙΟ':
        area = 'Λάκος Πανάνειο';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΚΗΠΟΥΠΟΛΗ ΙΙ':
        area = 'Κηπούπολη ΙΙ';
        break;
      case 'ΗΡΑΚΛΕΙΟ EΝΤΟΣ ΤΕΙΧΩΝ-ΠΡΟΑΣΤΙΑ':
        area = 'Εντός Τείχων - Προάστια';
        break;
      case 'ΗΡΑΚΛΕΙΟ ΣΥΝΟΙΚΙΑ ΑΤΣΑΛΕΝΙΟ Ι':
        area = 'Ατσαλενιο Ι';
        break;
      case 'ΗΡΑΚΛΕΙΟ-ΣΥΝΟΙΚΙΑ ΑΤΣΑΛΕΝΙΟ ΙΙ':
        area = 'Ατσαλενιο ΙΙ';
        break;
      case 'ΗΡΑΚΛΕΙΟ-ΣΥΝΟΙΚΙΑ ΜΑΣΤΑΜΠΑΣ':
        area = 'Μασταμπάς';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΑΓ. ΑΙΚΑΤΕΡΙΝΗΣ -ΕΡΓΑΤΙΚΕΣ ΚΑΤΟΙΚΙΕΣ':
        area = 'Αγ. Αικατερίνης - Εργατικές Κατοικίες';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΚΑΜΙΝΙΑ':
        area = 'Καμίνια';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΔΕΙΛΙΝΑ':
        area = 'Δειλινά';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΘΕΡΙΣΣΟΣ ΙΙ-ΠΕΡΙΟΧΗ ΜΙΧΑΗΛ ΑΡΧΑΓΓΕΛΟΥ':
        area = 'Θέρισσος ΙΙ - Μιχαήλ Αρχάγγελου';
        break;
      case 'ΦΟΙΝΙΚΙΑ':
        area = 'Φοινικιά';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΑΓ.ΑΙΚΑΤΕΡΙΝΗΣ ΙΙΙ':
        area = 'Αγ. Αικατερίνης ΙΙΙ';
        break;
      case 'ΒΕΛΟΝΙ ΚΑΜΠΟΣ-ΝΕΟΣ ΚΟΣΜΟΣ-ΑΓ.ΙΩΑΝΝΗΣ ΧΩΣΤΟΣ-ΤΕΙ':
        area = 'Βελόνι Κάμπος - Νέος Κόσμος - Αγ. Ιωάννης Χωστός - ΤΕΙ';
        break;
      case 'ΣΥΝΟΙΚΙΑ ΑΓ. ΙΩΑΝΝΗΣ':
        area = 'Αγ. Ιωάννης';
        break;
    }
    return area;
  }
}
